RedEchidnaUK/ESP32-WoL-Relay/src/config/config.h
#pragma once

#include <Arduino.h>
#include <Preferences.h>
// #include <ESPAsyncWebServer.h>
#include <PsychicHttp.h>
#include <WiFi.h>
#include <ESP32Ping.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>

#define RESET_PIN 0
#define RESET_HOLD_TIME 5000
#define LED 2
#define DEVICE_COUNT 10
#define DEBUG 1
#define STATUS_CHECK_INTERVAL 30000

#if DEBUG==1
#define outputDebug(x); Serial.print(x);
#define outputDebugLine(x); Serial.println(x);
#else
#define outputDebug(x); 
#define outputDebugLine(x); 
#endif

struct Device
{
    bool enabled;
    bool online;
    String name;
    String mac;
    String ip;
    String broadcast;
};

extern Device devices[DEVICE_COUNT];

extern String apiKey;
extern String wifiSSID;
extern String wifiPassword;
extern String adminUser;
extern String adminPassword;
extern uint32_t lastStatusCheck;
extern esp_timer_handle_t rebootTimer;


extern Preferences prefs;
// extern AsyncWebServer server;
extern PsychicHttpServer server;
extern AuthenticationMiddleware basicAuth;